cases/branch_d/c13_curv_sweep_r100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     chtMultiRegionSimpleFoam;

startFrom       latestTime;

startTime       0.001;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    adjustable;

writeInterval   400;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

maxCo           0.6;

maxDi           10;

adjustTimeStep  yes;

// functions disabled for C2 CHT smoke preflight
