cases/branch_d/c13_curv_sweep_r100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
    (0 -0.008 0.015)
    (0 -0.008 -0.015)
    (0 0.008 -0.015)
    (0 0.008 0.015)
    (0 -0.008 0.019)
    (0 0.008 0.019)
    (0.01224862316 -0.005411809549 0.01507615968)
    (0.01262167767 -0.005411809549 -0.01492152074)
    (0.01262167767 0.01058819045 -0.01492152074)
    (0.01224862316 0.01058819045 0.01507615968)
    (0.01219888256 -0.005411809549 0.0190758504)
    (0.01219888256 0.01058819045 0.0190758504)
    (0.02449535221 -0.003 0.01530462694)
    (0.02524140354 -0.003 -0.01468609508)
    (0.02524140354 0.013 -0.01468609508)
    (0.02449535221 0.013 0.01530462694)
    (0.0243958787 -0.003 0.01930338988)
    (0.0243958787 0.013 0.01930338988)
    (0.03673829332 -0.0009289321881 0.01568536646)
    (0.03785722611 -0.0009289321881 -0.01429375944)
    (0.03785722611 0.01507106781 -0.01429375944)
    (0.03673829332 0.01507106781 0.01568536646)
    (0.03658910228 -0.0009289321881 0.01968258324)
    (0.03658910228 0.01507106781 0.01968258324)
    (0.04897555326 0.0006602540378 0.01621831935)
    (0.05046719448 0.0006602540378 -0.01374457448)
    (0.05046719448 0.01666025404 -0.01374457448)
    (0.04897555326 0.01666025404 0.01621831935)
    (0.04877666777 0.0006602540378 0.02021337186)
    (0.04877666777 0.01666025404 0.02021337186)
    (0.06120523967 0.001659258263 0.0169034032)
    (0.06306935865 0.001659258263 -0.01303862513)
    (0.06306935865 0.01765925826 -0.01303862513)
    (0.06120523967 0.01765925826 0.0169034032)
    (0.06095669048 0.001659258263 0.02089567365)
    (0.06095669048 0.01765925826 0.02089567365)
    (0.07342546137 0.002 0.01774051207)
    (0.07566176984 0.002 -0.01217602055)
    (0.07566176984 0.018 -0.01217602055)
    (0.07342546137 0.018 0.01774051207)
    (0.07312728691 0.002 0.02172938309)
    (0.07312728691 0.018 0.02172938309)
    (0.08563432864 0.001659258263 0.01872951651)
    (0.08824248078 0.001659258263 -0.01115689415)
    (0.08824248078 0.01765925826 -0.01115689415)
    (0.08563432864 0.01765925826 0.01872951651)
    (0.08528657502 0.001659258263 0.02271437127)
    (0.08528657502 0.01765925826 0.02271437127)
    (0.0978299535 0.0006602540378 0.01987026359)
    (0.100809546 0.0006602540378 -0.009981403511)
    (0.100809546 0.01666025404 -0.009981403511)
    (0.0978299535 0.01666025404 0.01987026359)
    (0.0974326745 0.0006602540378 0.02385048587)
    (0.0974326745 0.01666025404 0.02385048587)
    (0.11001045 -0.0009289321881 0.02116257689)
    (0.1133610221 -0.0009289321881 -0.008649730414)
    (0.1133610221 0.01507106781 -0.008649730414)
    (0.11001045 0.01507106781 0.02116257689)
    (0.1095637071 -0.0009289321881 0.0251375512)
    (0.1095637071 0.01507106781 0.0251375512)
    (0.1221739347 -0.003 0.02260625658)
    (0.1258949682 -0.003 -0.007162080788)
    (0.1258949682 0.013 -0.007162080788)
    (0.1221739347 0.013 0.02260625658)
    (0.1216777969 -0.003 0.02657536822)
    (0.1216777969 0.013 0.02657536822)
    (0.1343185265 -0.005411809549 0.0242010794)
    (0.1384094461 -0.005411809549 -0.005518684681)
    (0.1384094461 0.01058819045 -0.005518684681)
    (0.1343185265 0.01058819045 0.0242010794)
    (0.1337730705 -0.005411809549 0.02816371461)
    (0.1337730705 0.01058819045 0.02816371461)
    (0.1464423474 -0.008 0.02594679874)
    (0.1509025204 -0.008 -0.003719796226)
    (0.1509025204 0.008 -0.003719796226)
    (0.1464423474 0.008 0.02594679874)
    (0.1458476577 -0.008 0.02990234473)
    (0.1458476577 0.008 0.02990234473)
    (0.1585435226 -0.01058819045 0.02784314463)
    (0.1633722593 -0.01058819045 -0.001765693601)
    (0.1633722593 0.005411809549 -0.001765693601)
    (0.1585435226 0.005411809549 0.02784314463)
    (0.1578996911 -0.01058819045 0.03179098973)
    (0.1578996911 0.005411809549 0.03179098973)
    (0.1706201808 -0.013 0.02988982384)
    (0.1758167346 -0.013 0.0003433210123)
    (0.1758167346 0.003 0.0003433210123)
    (0.1706201808 0.003 0.02988982384)
    (0.169927307 -0.013 0.03382935755)
    (0.169927307 0.003 0.03382935755)
    (0.1826704545 -0.01507106781 0.03208651986)
    (0.1882340217 -0.01507106781 0.002606921479)
    (0.1882340217 0.0009289321881 0.002606921479)
    (0.1826704545 0.0009289321881 0.03208651986)
    (0.1819286456 -0.01507106781 0.03601713298)
    (0.1819286456 0.0009289321881 0.03601713298)
    (0.1946924803 -0.01666025404 0.034432893)
    (0.2006222005 -0.01666025404 0.005024757759)
    (0.2006222005 -0.0006602540378 0.005024757759)
    (0.1946924803 -0.0006602540378 0.034432893)
    (0.1939018509 -0.01666025404 0.0383539777)
    (0.1939018509 -0.0006602540378 0.0383539777)
    (0.206684399 -0.01765925826 0.03692858041)
    (0.2129793553 -0.01765925826 0.00759645596)
    (0.2129793553 -0.001659258263 0.00759645596)
    (0.206684399 -0.001659258263 0.03692858041)
    (0.2058450715 -0.01765925826 0.04083953034)
    (0.2058450715 -0.001659258263 0.04083953034)
    (0.2186443562 -0.018 0.03957319618)
    (0.2253035752 -0.018 0.0103216184)
    (0.2253035752 -0.002 0.0103216184)
    (0.2186443562 -0.002 0.03957319618)
    (0.2177564603 -0.018 0.04347340655)
    (0.2177564603 -0.002 0.04347340655)
    (0.2305705025 -0.01765925826 0.04236633133)
    (0.2375929544 -0.01765925826 0.01319982365)
    (0.2375929544 -0.001659258263 0.01319982365)
    (0.2305705025 -0.001659258263 0.04236633133)
    (0.2296341756 -0.01765925826 0.04625519902)
    (0.2296341756 -0.001659258263 0.04625519902)
    (0.2424609936 -0.01666025404 0.04530755394)
    (0.2498455924 -0.01666025404 0.01623062665)
    (0.2498455924 -0.0006602540378 0.01623062665)
    (0.2424609936 -0.0006602540378 0.04530755394)
    (0.2414763805 -0.01666025404 0.04918447758)
    (0.2414763805 -0.0006602540378 0.04918447758)
    (0.2543139908 -0.01507106781 0.04839640918)
    (0.2620595946 -0.01507106781 0.0194135587)
    (0.2620595946 0.0009289321881 0.0194135587)
    (0.2543139908 0.0009289321881 0.04839640918)
    (0.2532812437 -0.01507106781 0.05226078925)
    (0.2532812437 0.0009289321881 0.05226078925)
    (0.2661276612 -0.013 0.0516324194)
    (0.2742330722 -0.013 0.0227481276)
    (0.2742330722 0.003 0.0227481276)
    (0.2661276612 0.003 0.0516324194)
    (0.2650469397 -0.013 0.0554836583)
    (0.2650469397 0.003 0.0554836583)
    (0.2779001779 -0.01058819045 0.05501508418)
    (0.2863641427 -0.01058819045 0.0262338177)
    (0.2863641427 0.005411809549 0.0262338177)
    (0.2779001779 0.005411809549 0.05501508418)
    (0.2767716492 -0.01058819045 0.05885258637)
    (0.2767716492 0.005411809549 0.05885258637)
    (0.2896297204 -0.008 0.05854388042)
    (0.2984509301 -0.008 0.02987008998)
    (0.2984509301 0.008 0.02987008998)
    (0.2896297204 0.008 0.05854388042)
    (0.2884535591 -0.008 0.06236705248)
    (0.2884535591 0.008 0.06236705248)
);
blocks
(
    hex (0 6 9 3 4 10 11 5) (4 8 8) simpleGrading (1 1 1)
    hex (6 12 15 9 10 16 17 11) (4 8 8) simpleGrading (1 1 1)
    hex (12 18 21 15 16 22 23 17) (4 8 8) simpleGrading (1 1 1)
    hex (18 24 27 21 22 28 29 23) (4 8 8) simpleGrading (1 1 1)
    hex (24 30 33 27 28 34 35 29) (4 8 8) simpleGrading (1 1 1)
    hex (30 36 39 33 34 40 41 35) (4 8 8) simpleGrading (1 1 1)
    hex (36 42 45 39 40 46 47 41) (4 8 8) simpleGrading (1 1 1)
    hex (42 48 51 45 46 52 53 47) (4 8 8) simpleGrading (1 1 1)
    hex (48 54 57 51 52 58 59 53) (4 8 8) simpleGrading (1 1 1)
    hex (54 60 63 57 58 64 65 59) (4 8 8) simpleGrading (1 1 1)
    hex (60 66 69 63 64 70 71 65) (4 8 8) simpleGrading (1 1 1)
    hex (66 72 75 69 70 76 77 71) (4 8 8) simpleGrading (1 1 1)
    hex (72 78 81 75 76 82 83 77) (4 8 8) simpleGrading (1 1 1)
    hex (78 84 87 81 82 88 89 83) (4 8 8) simpleGrading (1 1 1)
    hex (84 90 93 87 88 94 95 89) (4 8 8) simpleGrading (1 1 1)
    hex (90 96 99 93 94 100 101 95) (4 8 8) simpleGrading (1 1 1)
    hex (96 102 105 99 100 106 107 101) (4 8 8) simpleGrading (1 1 1)
    hex (102 108 111 105 106 112 113 107) (4 8 8) simpleGrading (1 1 1)
    hex (108 114 117 111 112 118 119 113) (4 8 8) simpleGrading (1 1 1)
    hex (114 120 123 117 118 124 125 119) (4 8 8) simpleGrading (1 1 1)
    hex (120 126 129 123 124 130 131 125) (4 8 8) simpleGrading (1 1 1)
    hex (126 132 135 129 130 136 137 131) (4 8 8) simpleGrading (1 1 1)
    hex (132 138 141 135 136 142 143 137) (4 8 8) simpleGrading (1 1 1)
    hex (138 144 147 141 142 148 149 143) (4 8 8) simpleGrading (1 1 1)
    hex (1 7 8 2 0 6 9 3) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (7 13 14 8 6 12 15 9) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (13 19 20 14 12 18 21 15) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (19 25 26 20 18 24 27 21) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (25 31 32 26 24 30 33 27) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (31 37 38 32 30 36 39 33) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (37 43 44 38 36 42 45 39) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (43 49 50 44 42 48 51 45) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (49 55 56 50 48 54 57 51) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (55 61 62 56 54 60 63 57) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (61 67 68 62 60 66 69 63) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (67 73 74 68 66 72 75 69) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (73 79 80 74 72 78 81 75) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (79 85 86 80 78 84 87 81) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (85 91 92 86 84 90 93 87) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (91 97 98 92 90 96 99 93) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (97 103 104 98 96 102 105 99) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (103 109 110 104 102 108 111 105) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (109 115 116 110 108 114 117 111) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (115 121 122 116 114 120 123 117) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (121 127 128 122 120 126 129 123) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (127 133 134 128 126 132 135 129) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (133 139 140 134 132 138 141 135) (4 8 50) simpleGrading (1 1 0.021725732)
    hex (139 145 146 140 138 144 147 141) (4 8 50) simpleGrading (1 1 0.021725732)
);
edges ();
boundary
(
    inlet
    {
        type patch;
        faces ((1 2 3 0));
    }
    outlet
    {
        type patch;
        faces ((145 144 147 146));
    }
    blanket_back_wall
    {
        type wall;
        faces
        (
        (1 7 8 2)
        (7 13 14 8)
        (13 19 20 14)
        (19 25 26 20)
        (25 31 32 26)
        (31 37 38 32)
        (37 43 44 38)
        (43 49 50 44)
        (49 55 56 50)
        (55 61 62 56)
        (61 67 68 62)
        (67 73 74 68)
        (73 79 80 74)
        (79 85 86 80)
        (85 91 92 86)
        (91 97 98 92)
        (97 103 104 98)
        (103 109 110 104)
        (109 115 116 110)
        (115 121 122 116)
        (121 127 128 122)
        (127 133 134 128)
        (133 139 140 134)
        (139 145 146 140)
        );
    }
    side_walls
    {
        type wall;
        faces
        (
        (1 0 6 7)
        (2 8 9 3)
        (7 6 12 13)
        (8 14 15 9)
        (13 12 18 19)
        (14 20 21 15)
        (19 18 24 25)
        (20 26 27 21)
        (25 24 30 31)
        (26 32 33 27)
        (31 30 36 37)
        (32 38 39 33)
        (37 36 42 43)
        (38 44 45 39)
        (43 42 48 49)
        (44 50 51 45)
        (49 48 54 55)
        (50 56 57 51)
        (55 54 60 61)
        (56 62 63 57)
        (61 60 66 67)
        (62 68 69 63)
        (67 66 72 73)
        (68 74 75 69)
        (73 72 78 79)
        (74 80 81 75)
        (79 78 84 85)
        (80 86 87 81)
        (85 84 90 91)
        (86 92 93 87)
        (91 90 96 97)
        (92 98 99 93)
        (97 96 102 103)
        (98 104 105 99)
        (103 102 108 109)
        (104 110 111 105)
        (109 108 114 115)
        (110 116 117 111)
        (115 114 120 121)
        (116 122 123 117)
        (121 120 126 127)
        (122 128 129 123)
        (127 126 132 133)
        (128 134 135 129)
        (133 132 138 139)
        (134 140 141 135)
        (139 138 144 145)
        (140 146 147 141)
        );
    }
    heatedBase
    {
        type wall;
        faces
        (
        (4 5 11 10)
        (10 11 17 16)
        (16 17 23 22)
        (22 23 29 28)
        (28 29 35 34)
        (34 35 41 40)
        (40 41 47 46)
        (46 47 53 52)
        (52 53 59 58)
        (58 59 65 64)
        (64 65 71 70)
        (70 71 77 76)
        (76 77 83 82)
        (82 83 89 88)
        (88 89 95 94)
        (94 95 101 100)
        (100 101 107 106)
        (106 107 113 112)
        (112 113 119 118)
        (118 119 125 124)
        (124 125 131 130)
        (130 131 137 136)
        (136 137 143 142)
        (142 143 149 148)
        );
    }
    solidSides
    {
        type wall;
        faces
        (
        (0 4 10 6)
        (3 9 11 5)
        (6 10 16 12)
        (9 15 17 11)
        (12 16 22 18)
        (15 21 23 17)
        (18 22 28 24)
        (21 27 29 23)
        (24 28 34 30)
        (27 33 35 29)
        (30 34 40 36)
        (33 39 41 35)
        (36 40 46 42)
        (39 45 47 41)
        (42 46 52 48)
        (45 51 53 47)
        (48 52 58 54)
        (51 57 59 53)
        (54 58 64 60)
        (57 63 65 59)
        (60 64 70 66)
        (63 69 71 65)
        (66 70 76 72)
        (69 75 77 71)
        (72 76 82 78)
        (75 81 83 77)
        (78 82 88 84)
        (81 87 89 83)
        (84 88 94 90)
        (87 93 95 89)
        (90 94 100 96)
        (93 99 101 95)
        (96 100 106 102)
        (99 105 107 101)
        (102 106 112 108)
        (105 111 113 107)
        (108 112 118 114)
        (111 117 119 113)
        (114 118 124 120)
        (117 123 125 119)
        (120 124 130 126)
        (123 129 131 125)
        (126 130 136 132)
        (129 135 137 131)
        (132 136 142 138)
        (135 141 143 137)
        (138 142 148 144)
        (141 147 149 143)
        (0 3 5 4)
        (144 148 149 147)
        );
    }
);
mergePatchPairs ();
