cases/branch_d/c13_curv_sweep_r100/0/bottomWater/U
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (1.16 0 0);
boundaryField
{
    inlet { type fixedValue; value uniform (1.16 0 0); }
    outlet { type pressureInletOutletVelocity; value uniform (0 0 0); }
    "(blanket_back_wall|side_walls|bottomWater_to_heater)" { type noSlip; }
}
